/*****************************************************************************
Файл: OneWire.h
Creted by PROTTOSS
Mail to PROTTOSS@mail.ru
заголовочный файл для модуля интерфейса DALLAS 1-Wire
09.01.2006
******************************************************************************/
#ifndef __ONEWIRE_H_
#define __ONEWIRE_H_

#include "stdBool.h"

// определение портов для шины 1-wire
#define OW_PORT PORTD
#define OW_DDR  DDRD
#define OW_PIN  PIND

//#define OW_BUS  PD3
//#define OW_BUS_MASK (1 << OW_BUS)

/*****************************************************************************  
Прототипы функций
*****************************************************************************/


//void OW_SendByte(char data); // посылка байта в линию
//bool OW_DetectPresence(void);// сброс и определение устройства на шине
//char OW_ReceiveByte(void); // прием байта с линии

/*****************************************************************************
определения для термостата DS1821
*****************************************************************************/
#define OW_1821_TH_LIMIT            99// вообще 125, но нет поддержки вывода >99
#define OW_1821_TL_LIMIT            55

/*****************************************************************************
команды для термостата DS1821
*****************************************************************************/
#define OW_1821_READ_TEMPERATURE    0xAA// чтение помледнего измерения температуры
#define OW_1821_WRITE_TH            0x01// запись верхнего предела термомстата
#define OW_1821_WRITE_TL            0x02// запись нижнего предела термостата
#define OW_1821_READ_TH             0xA1// чтение верхнего предела термотстата
#define OW_1821_READ_TL             0xA2// чтение нижнего предела термостата
#define OW_1821_WRITE_STATUS        0x0C// запись конфигурации в регистр конфигурации
#define OW_1821_READ_STATUS         0xAC// чтение конфигурации из регистра конфигурации
#define OW_1821_START_CONVERT_T     0xEE// инициализация измерения температуры
#define OW_1821_STOP_CONVERT_T      0x22// пристановка измерения температуры


// export 
#ifdef __cplusplus 
extern "C" {
#endif 

bool OW_DetectPresence(void);// сброс и определение устройства на шине
char OW_ReceiveByte(void); // прием байта с линии
void OW_SendByte(char data);

#ifdef __cplusplus 
}
#endif 


#endif//__ONEWIRE_H_
